In [10]:
import pandas as pd
import numpy as np
from numpy import nan as NA
import matplotlib.pyplot as plt

In [6]:
string_data=pd.Series(['one','two',np.nan,'four'])

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data.dropna()

0     one
1     two
3    four
dtype: object

In [9]:
string_data.fillna('woop')

0     one
1     two
2    woop
3    four
dtype: object

In [15]:
data=pd.DataFrame([[1,2,3],[1,NA,4],[NA,NA,NA],[NA,6,7]])
data

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  4.0
2  NaN  NaN  NaN
3  NaN  6.0  7.0

In [16]:
data.dropna(how='all') #drops a row if its all NaN

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  4.0
3  NaN  6.0  7.0

In [20]:
data[4]=NA
data

     0    1    2   4
0  1.0  2.0  3.0 NaN
1  1.0  NaN  4.0 NaN
2  NaN  NaN  NaN NaN
3  NaN  6.0  7.0 NaN

In [22]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  4.0
2  NaN  NaN  NaN
3  NaN  6.0  7.0

In [24]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.132771       NaN       NaN
1 -0.504292       NaN       NaN
2  0.344949       NaN  0.799542
3 -1.330293       NaN  1.564390
4 -1.833377 -0.684593  1.232528
5 -0.843351  0.300704  0.750877
6  0.598373  0.324891  1.123966

In [26]:
df.dropna()

          0         1         2
4 -1.833377 -0.684593  1.232528
5 -0.843351  0.300704  0.750877
6  0.598373  0.324891  1.123966

In [27]:
df.fillna(0)

          0         1         2
0  0.132771  0.000000  0.000000
1 -0.504292  0.000000  0.000000
2  0.344949  0.000000  0.799542
3 -1.330293  0.000000  1.564390
4 -1.833377 -0.684593  1.232528
5 -0.843351  0.300704  0.750877
6  0.598373  0.324891  1.123966

In [28]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.132771  0.500000  0.000000
1 -0.504292  0.500000  0.000000
2  0.344949  0.500000  0.799542
3 -1.330293  0.500000  1.564390
4 -1.833377 -0.684593  1.232528
5 -0.843351  0.300704  0.750877
6  0.598373  0.324891  1.123966

In [36]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[4:,1]=NA
df.iloc[2:,2]=NA
df.iloc[5,1]=3
df

          0         1         2
0  0.193602 -0.856755  0.927052
1  0.360491 -1.483886 -0.615217
2 -1.620157 -1.756199       NaN
3  0.114550 -0.870165       NaN
4 -0.351153       NaN       NaN
5 -1.090156  3.000000       NaN
6 -1.310209       NaN       NaN

In [37]:
df.fillna(method='ffill')

          0         1         2
0  0.193602 -0.856755  0.927052
1  0.360491 -1.483886 -0.615217
2 -1.620157 -1.756199 -0.615217
3  0.114550 -0.870165 -0.615217
4 -0.351153 -0.870165 -0.615217
5 -1.090156  3.000000 -0.615217
6 -1.310209  3.000000 -0.615217

In [39]:
df.fillna(df.mean())

          0         1         2
0  0.193602 -0.856755  0.927052
1  0.360491 -1.483886 -0.615217
2 -1.620157 -1.756199  0.155917
3  0.114550 -0.870165  0.155917
4 -0.351153 -0.393401  0.155917
5 -1.090156  3.000000  0.155917
6 -1.310209 -0.393401  0.155917

In [40]:
df.fillna(df[1].mean())

          0         1         2
0  0.193602 -0.856755  0.927052
1  0.360491 -1.483886 -0.615217
2 -1.620157 -1.756199 -0.393401
3  0.114550 -0.870165 -0.393401
4 -0.351153 -0.393401 -0.393401
5 -1.090156  3.000000 -0.393401
6 -1.310209 -0.393401 -0.393401